/*=========================================================================
	Date : 2021/01/21(金)	OutputConsole.cpp
		Author	: がむしるぉ
		Update	:
		Comment	:
		※古本氏の資料データを簡易的に利用する暮らす(Living)
=========================================================================*/
#include "OutputConsole.h"


/*=============================================================================================
	初期化処理
=============================================================================================*/
void OutputConsole::Init()
{
#ifdef _DEBUG
	AllocConsole();									//コンソールウィンドウの作成
	(void)freopen_s(&m_Output, "CON", "w", stdout);
	m_Console = GetStdHandle(STD_OUTPUT_HANDLE);
	m_CurosrPos.X = 0;
	m_CurosrPos.Y = 0;
#endif // _DEBUG	
}

/*=============================================================================================
	終了処理
=============================================================================================*/
void OutputConsole::Uninit()
{
#ifdef _DEBUG
	//コンソールの解放
	fclose(m_Output);
	FreeConsole();
#endif // _DEBUG
}

/*=============================================================================================
	更新処理
=============================================================================================*/
void OutputConsole::Update()
{
#ifdef _DEBUG
	//カーソルを左上に移動
	SetConsoleCursorPosition(m_Console, m_CurosrPos);
#endif // _DEBUG
}

/*=============================================================================================
	コンソールウィンドウのクリア処理
=============================================================================================*/
void OutputConsole::Clear()
{
#ifdef _DEBUG
	//コンソールの初期化
	system("cls");
#endif // _DEBUG
}
